%%
%第三问
clear
clc
L=0.5;
m=1;
g=9.8;
A=[0 -g/L 0;1 0 0;0 0 -10];
B=[1/(m*L) 0 30]';
C=[0 1 0];
% K=[k1 k2 k3];
Qc=[B A*B A^2*B]%能控判别矩阵
Qo=[C;C*A;C*A^2]
%%
%第四问
clear
clc
syms s y z1 z2 v a b
L=0.5;m=1;g=9.8;
A=[0 -g/L 1/(m*L);1 0 0;0 0 -10];
B=[0 0 30]';
C=[0 1 0];
I=eye(2);
Qc=[B A*B (A^2)*B]%能控判别矩阵
Qo=[C;C*A;C*A^2]
T=[0 1 0;0 0 1;1 0 0];
A_=T^(-1)*A*T;
B_=T^(-1)*B;
C_=C*T;
A_11=A_(1:2,1:2);A_12=A_(1:2,3);A_21=A_(3,1:2);A_22=A_(3,3);
B_1=[30;0];B_2=0;
L_=[1,0.6378];
%L_=[a b];%降维观测器反馈阵
fs=det(s*I-(A_22-L_*A_12))%只与状态观测器反馈阵中的a相关s^3 - (294*b*s^2)/5
Z=vpa((A_22-L_*A_12)*([z1,z2]+L_*y)+(A_21-L_*A_11)*y+(B_2-L_*B_1)*v,4)
% Z=(A_22-L_*A_12)*z+((A_22-L_*A_12)*L_+(A_21-L_*A_11))*y+(B_2-L_*B_1)*u %a任意选取
%%
%状态控制器
%设L_=[1,b]
%设极点为0,0,-25,得b=0.4252
clear
clc
syms s k1 k2 k3
L=0.5;m=1;g=9.8;
A=[0 -g/L 1/(m*L);1 0 0;0 0 -10];
B=[0 0 30]';
C=[0 1 0];
I=eye(3);
Qc=[B A*B (A^2)*B];%能控判别矩阵
Qo=[C;C*A;C*(A^2)];
% L_=[1,0.4252];
G(s)=det(s*I-A)
p=[19.6 10 1;10 1 0;1 0 0];
P=Qc*p;
Ac=(P^-1)*A*P
Bc=(P^-1)*B
Cc=C*P
%K=[k1 k2 k3];
%f(s)=det(s*I-(Ac-Bc*K))
