% **************************
% 利用伪逆规则计算权值矩阵
% P=[p1,p2...,pn]，T=[t1,t2,..,tn]
% P的伪逆矩阵pseudo inverse matrix：P_PI=((P'*P)^(-1))*P'
% W=T*P_PI
% **************************
clc;clear;close all;
p1=[1;-1;1;-1];p2=[1;1;-1;-1];
t1=[1;-1];t2=[1;1];
P=[p1,p2];                                                           %输入矩阵P[Q×N]
T=[t1,t2];                                                             %期望输出矩阵T[S×N]
P_PI=((P'*P)^(-1))*P';                                           %求P的伪逆矩阵[N×Q]
W=T*P_PI;                                                           %权值矩阵[S×Q]
W*p1