% **************************
% 利用牛顿法求F=0.5*x'*[8,-4;-4,6]*x+[1,0]*x在初始点[0,0]'的极小值点和极小值
% 迭代公式：a0=-(F_1*p0)/(p0'*F_2*p0)
%                 p0=-g0
%                 xk=xk_1+ak_1*pk_1
%                 gk=F_1
%                 bk=gk'gk/gk_1'*gk_1
%                 pk=-gk+bk*pk_1
%                 ak=-(F_1'*pk)/(pk'*F_2*pk)
% 其中F_1矩阵是F的一阶导公式，F_2是二阶导公式
% 程序运行初值是[0;0]时会出错，更换初值可以求解，未找到问题所在
% **************************
clc;clear;close all;
x0=[0,0]';                                                             %初始点
% x0=[0.5,0.5]';
x_0=x0;                                                               %迭代中的老向量   预先分配空间
x_1=ones(2,1);                                                     %迭代中的新向量   预先分配空间
x_min=ones(2,1);                                                 %最终结果向量   预先分配空间
e=1e-6;                                                               %收敛精度
A=[8,-4;-4,6];
% A=[2,2;2,4];
B=[1;0];
F_1=A*x_0+B;F_2=A;
g_0=F_1;
p_0=-g_0;
a_0=-(F_1'*p_0)/(p_0'*F_2*p_0);
while(1)
    x_1=x_0+a_0*p_0                                             %求x_1
    x_e=norm(x_1-x_0,2)
    if(x_e<e)                                                          %计算向量二范数是否小于指定精度
        x_min=x_1;
        break;
    end
    %更新参数
    x_0=x_1;                                                          
    F_1=A*x_0+B;
    F_2=A;
    g_1=F_1;
    b_1=(g_1'*g_1)/(g_0'*g_0);
    p_1=-g_1+b_1*p_0;
    a_1=-(F_1'*p_1)/(p_1'*F_2*p_1);
    g_0=g_1;b_0=b_1;p_0=p_1;a_0=a_1;
end
F_min=0.5*x_min'*[8,-4;-4,6]*x_min+[1,0]*x_min;