% **************************
% 利用牛顿法求F=x1^2+x2^2-x1*x2-10*x1-4*x2+60在初始点[0,0]'的极小值点和极小值
% 多维迭代公式：x_1=x_0-B^(-1)*A
% 其中A矩阵是F的一阶导公式，B矩阵是二阶导公式
% 
% **************************
clc;clear;close all;
x0=[0,0]';                                                             %初始点
x_0=x0;                                                               %迭代中的老向量   预先分配空间
x_1=ones(2,1);                                                     %迭代中的新向量   预先分配空间
x_min=ones(2,1);                                                 %最终结果向量   预先分配空间
e=1e-6;                                                               %收敛精度
while(1)
    A=[2*x_0(1)-x_0(2)-10;2*x_0(2)-x_0(1)-4];          %对F求一阶偏导
    B=[2,-1;-1,2];                                                   %对F求二阶偏导
    x_1=x_0-B^(-1)*A;                                           %求x_1
    if(norm(x_1-x_0,2)<e)                                       %计算向量二范数是否小于指定精度
        x_min=x_1;
        break;
    end
    x_0=x_1;                                                          %更新x_0
end
F_min=x_min(1)^2+x_min(2)^2-x_min(1)*x_min(2)-10*x_min(1)-4*x_min(2)+60;